Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The possibilities are endless once deployed to Kubernetes! Reusing the same example above (developing the Fight service), you could use https://quarkus.io/guides/maven-tooling#remote-development-mode[Quarkus Remote Development Mode^] to connect the remote instance to your local machine and get an experience similar to https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus Dev Mode^]. No need to do any port forwarding!
ja_jp: Kubernetesにデプロイされると、可能性は無限に広がります!上記の同じ例（Fightサービスの開発）を再利用すると、 link:https://quarkus.io/guides/maven-tooling#remote-development-mode[Quarkus Remote Development Mode, window=_blank]を使用してリモートインスタンスをローカルマシンに接続し、 link:https://quarkus.io/guides/maven-tooling#dev-mode[Quarkus 開発モード, window=_blank]と同様のエクスペリエンスを得ることができます。ポートフォワーディングの必要はありません。

source: The possible values are:
ja_jp: 指定可能な値は以下の通りです。

source: The pre-transaction and transactional blocks are invoked on the same Redis connection. Consequently, the pre-transaction block must use the passed data source to execute commands. Thus, the commands are emitted from that connection. These commands must not modify the watched keys.
ja_jp: プレトランザクションブロックとトランザクションブロックは、同じ Redis 接続で呼び出されます。その結果、プレトランザクションブロックは、渡されたデータソースを使用してコマンドを実行する必要があります。したがって、コマンドはその接続から発行されます。これらのコマンドは、監視されたキーを変更することはできません。

source: The preceding configuration references Keycloak, which is used by `ProtectedResource` to verify the incoming access tokens and by `OidcClient` to get the tokens for a user `alice` by using a `password` grant. Both REST clients point to ``ProtectedResource``'s HTTP address.
ja_jp: 上記の設定は Keycloak を参照します。Keycloak は、受信アクセストークンを検証するために `ProtectedResource` によって使用され、 `password` グラントを使用してユーザー `alice` のトークンを取得するために `OidcClient` によって使用されます。どちらの REST クライアントも ``ProtectedResource`` の HTTP アドレスを指しています。

source: The preceding example assumes that the `tenant-a`, `tenant-b` and default tenants are all used to protect the same endpoint paths. In other words, after the user has authenticated with the `tenant-a` configuration, this user will not be able to choose to authenticate with the `tenant-b` or default configuration before this user logs out and has a session cookie cleared or expired.
ja_jp: 上記の例では、`tenant-a`、`tenant-b`、およびデフォルトのテナントがすべて同じエンドポイントパスを保護するために使用されていることを前提としています。つまり、ユーザーが `tenant-a` 設定で認証された後、このユーザーはログアウトしてセッション Cookie がクリアされるか期限切れになるまで、`tenant-b` またはデフォルトの設定で認証することを選択できません。

source: The preceding example demonstrates how the application can be protected and identities provided by the specified database.
ja_jp: 上記の例は、指定されたデータベースによってアプリケーションがどのように保護されて ID が提供されるかを示しています。

source: The preceding example obtains an access token for the user `alice`.
ja_jp: 上記の例では、ユーザー `alice` のアクセストークンを取得します。

source: The preceding permission set shows that `GET /public/foo` matches the paths of both permission sets.However, it specifically aligns with the explicit method of the `permit1` permission set. Therefore, `permit1` is selected, and the request is accepted.
ja_jp: 上記の権限セットは、 `GET /public/foo` が両方の権限セットのパスにマッチすることを示しています。ただし、これは `permit1` 権限セットの明示的なメソッドと明確に一致しています。したがって、 `permit1` が選択され、リクエストは受け入れられます。

source: The preceding permission set shows that `GET /public/foo` matches the paths of both permission sets.However, it specifically aligns with the explicit method of the `permit1` permission set.Therefore, `permit1` is selected, and the request is accepted.
ja_jp: 上記の権限セットは、 `GET /public/foo` が両方の権限セットのパスにマッチすることを示しています。ただし、これは `permit1` 権限セットの明示的なメソッドと明確に一致しています。したがって、 `permit1` が選択され、リクエストが受け入れられます。

source: The preferred approach for informing clients and servers about the certificate reload is to fire a CDI event of type `io.quarkus.tls.CertificateUpdatedEvent`. To do so, inject a CDI event of this type and fire it when a reload occurs.
ja_jp: クライアントとサーバーに証明書の再読み込みを通知するための推奨されるアプローチは、`io.quarkus.tls.CertificateUpdatedEvent` 型の CDI イベントを発生させることです。これを行うには、この型の CDI イベントを注入し、再読み込みが発生したときにそれを発生させます。

source: The preferred approach for integration testing against Keycloak is xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak]. `Dev Services for Keycloak` will start and initialize a test container. Then, it will create a `quarkus` realm and a `quarkus-app` client (`secret` secret) and add `alice` (`admin` and `user` roles) and `bob` (`user` role) users, where all of these properties can be customized.
ja_jp: Keycloak に対する結合テストには、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を使用することを推奨します。 `Dev Services for Keycloak` は、テストコンテナーを起動して初期化します。次に、 `quarkus` レルムと `quarkus-app` クライアント (`secret` シークレット) を作成し、 `alice` (`admin` および `user` ロール) および `bob` (`user` ロール) ユーザーを追加します。これらのプロパティーはすべてカスタマイズできます。

source: The preferred approach for integration testing against Keycloak is xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak]. `Dev Services for Keycloak` will start and initialize a test container. Then, it will create a `quarkus` realm and a `quarkus-app` client with `secret` as the client secret. It will also add two users: `alice` with both `admin` and `user` roles, and `bob` with the `user` role. All of these properties can be customized.
ja_jp: Keycloak に対する結合テストには、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を使用することを推奨します。 `Dev Services for Keycloak` は、テストコンテナーを起動して初期化します。次に、 `quarkus` レルムと、クライアントシークレットが `secret` の `quarkus-app` クライアントを作成します。また、`admin` と `user` の両方のロールを持つ `alice` と、 `user` ロールを持つ `bob` の 2 人のユーザーも追加します。これらのプロパティーはすべてカスタマイズできます。

source: The preferred approach for testing Keycloak Admin Client against Keycloak is xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak]. `Dev Services for Keycloak` will start and initialize a test container. Then, it will create a `quarkus` realm and a `quarkus-app` client (`secret` secret) and add `alice` (`admin` and `user` roles) and `bob` (`user` role) users, where all of these properties can be customized.
ja_jp: Keycloakに対するKeycloak Admin Clientのテストには、 xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を使用します。 `Dev Services for Keycloak` はテストコンテナを起動して初期化します。そして、 `quarkus` realmと `quarkus-app` client ( `secret` secret)を作成し、 `alice` ( `admin` と `user` role)と `bob` ( `user` role)のユーザーを追加します。

source: The prefix can be configured by using the `prefix` property:
ja_jp: プレフィックスは `prefix` プロパティで設定できます：

source: The presence of `@Transactional` annotation implies blocking execution.
ja_jp: `@Transactional` アノテーションの存在は、実行をブロックすることを意味します。

source: The presence of the JDBC driver will enable Hibernate ORM. If you want to disable it, and only use Hibernate Reactive, you can use:
ja_jp: JDBC ドライバーが存在すると Hibernate ORM が有効になります。それを無効にし、Hibernate Reactive のみを使用したい場合は、次のようにします。

source: The presence of this extension will, by default, replace the output format configuration from the console configuration. This means that the format string and the color settings (if any) will be ignored. The other console configuration items (including those controlling asynchronous logging and the log level) will continue to be applied.
ja_jp: このエクステンションが存在すると、デフォルトではコンソール設定からの出力フォーマット設定を置き換えます。つまり、フォーマット文字列と色の設定(もしあれば)は無視されます。他のコンソール設定項目(非同期ロギングやログレベルを制御するものを含む)は引き続き適用されます。

source: The preview of your document should contain the abstract as a paragraph immediately following the header.
ja_jp: ドキュメントのプレビューには、ヘッダーのすぐ後の段落に概要が含まれている必要があります。

source: The preview of your document should contain the chosen title as a styled header at the top of the page.
ja_jp: ドキュメントのプレビューには、選択したタイトルがスタイル付きヘッダーとしてページの上部に含まれている必要があります。

source: The preview of your document should now include an admonition box below the abstract explaining that the plugin is experimental technology, and describing what can be expected in terms of stability and/or support for experimental technologies.
ja_jp: ドキュメントのプレビューには、プラグインが実験的な技術であることの説明、および安定性や実験的な技術のサポートに期待できることの説明に関する注意書きのボックスを概要の下に表示するようにしました。

source: The preview of your document should now include an admonition box below the abstract explaining that the plugin is experimental technology, and describing what can be expected in terms of stability or support for experimental technologies.
ja_jp: ドキュメントのプレビューには、アブストラクトの下に、プラグインが実験的な技術であることを説明し、実験的な技術の安定性またはサポートに関して何が期待できるかを説明する警告ボックスが含まれているはずです。

source: The previous `AnnotationsTransformer` API from ArC is still supported, but the new `AnnotationTransformation` API from Jandex is preferred.
ja_jp: ArC の以前の `AnnotationsTransformer` API も引き続きサポートされますが、Jandex の新しい `AnnotationTransformation` API が推奨されます。

source: The previous code snippet uses `io.smallrye.common.vertx.ContextLocals`, which eases access to the local data. You can also access them using `Vertx.currentContext().getLocal("key")`.
ja_jp: 先ほどのコード・スニペットでは `io.smallrye.common.vertx.ContextLocals` を使い、ローカル・データへのアクセスを簡素化しています。 `Vertx.currentContext().getLocal("key")` を使ってもアクセスできます。

source: The previous configuration uses the xref:./tls-registry-reference.adoc[centralized TLS configuration]. This is the recommended approach.
ja_jp: 以前の設定では、xref:./tls-registry-reference.adoc[一元化された TLS 設定] が使用されています。 これが推奨されるアプローチです。

source: The previous configuration, combined with the presence of `quarkus-datasource`, `quarkus-jdbc-postgresql`, `quarkus-kubernetes`, and `quarkus-kubernetes-service-binding` properties in the application, results in the generation of the `ServiceBinding` resource for the `postgresql` database type.
ja_jp: 前述の設定と、アプリケーション内の `quarkus-datasource`、`quarkus-jdbc-postgresql`、`quarkus-kubernetes` および `quarkus-kbernetes-service-binding` プロパティーの存在により、データベースタイプ `postgresql` 用の `ServiceBinding` リソースが生成されます。

source: The previous configuration, combined with the presence of `quarkus-datasource`, `quarkus-jdbc-postgresql`, `quarkus-kubernetes`, and `quarkus-kubernetes-service-binding` properties in the application, results in the generation of the `ServiceBinding` resource for the the `postgresql` database type.
ja_jp: 前述の設定と、アプリケーション内の `quarkus-datasource`、 `quarkus-jdbc-postgresql`、 `quarkus-kubernetes` および `quarkus-kbernetes-service-binding` プロパティーの存在により、データベースタイプ `postgresql` 用の `ServiceBinding` リソースが生成されます。

source: The previous example is trivial and doesn't capture how imperative style can simplify complex reactive operations. Below is a more complex example. The endpoints must now fetch all the fortunes in the database, then append a quote to each fortune before finally returning the result to the client.
ja_jp: 先ほどの例はささいなもので、命令型スタイルが複雑なリアクティブ操作をいかに簡略化できるかをとらえていません。次はもっと複雑な例です。エンドポイントはデータベース内のすべての運勢(fortune)を取得し、 結果をクライアントに返す前にそれぞれの運勢に引用文を追加します。

source: The previous example uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: 前の例はMutinyリアクティブ型を使用しています。Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - 直感的なリアクティブプログラミングライブラリ]をご覧ください。

source: The previous examples use synchronous processing. Asynchronous processing is also possible by returning either an `io.smallrye.mutiny.Uni` or a `java.util.concurrent.CompletionStage`:
ja_jp: これまでの例では、同期処理を行っています。 `io.smallrye.mutiny.Uni` または `java.util.concurrent.CompletionStage` を返却することで、非同期処理も可能です。

source: The previous implementation still remains available for now in case the new one appears to introduce not yet detected regressions and can be enabled by setting `disableQuarkusComponentVariants` project property to `true`.
ja_jp: 新しい実装がまだ検出されていないリグレッションを導入する可能性がある場合に備えて、以前の実装は今のところ引き続き利用可能であり、`disableQuarkusComponentVariants` プロジェクトプロパティーを `true` に設定することで有効にできます。

source: The previous method is suggested for any case when the user can annotate their classes. Unfortunately the user may not be able to annotate all classes they will put in the cache. In this case you must define your schema and create your own Marshaller(s) yourself.
ja_jp: 前の方法は、ユーザが自分のクラスにアノテーションを付けられる場合のために提案されています。残念ながら、ユーザはキャッシュに入れるすべてのクラスにアノテーションを付けることができないかもしれません。このような場合はスキーマを定義し、自分で独自のマーシャラを作成しなければなりません。

source: The previous one is still available and has been marked as deprecated. It will be removed in a few versions.
ja_jp: 以前のものはまだ利用可能で、非推奨としてマークされています。数回のバージョンアップのうちに削除される予定です。

source: The previous section showed you how to build a native executable using Maven or Gradle, but it requires you to have created the native executable first. In addition, this native executable must be a Linux 64 bits executable.
ja_jp: 前のセクションでは、Maven または Gradle を使用してネイティブ実行可能ファイルをビルドする方法を示しましたが、その場合は最初にネイティブ実行可能ファイルを作成しておく必要があります。さらに、このネイティブ実行可能ファイルは Linux64 ビットの実行可能ファイルである必要があります。

source: The previous snippet produces:
ja_jp: 前のスニペットは以下を生成します。

source: The previous snippet uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: 前のスニペットでは、Mutinyのリアクティブ型を使用していますが、もし慣れていない場合は、まず xref:mutiny-primer.adoc[Mutiny - 直感的なリアクティブプログラミングライブラリ] を読んでください。

source: The previous table does not include the `org.jboss.resteasy.annotations.Form` annotation because there is no Quarkus REST specific replacement for it. Users are instead encouraged to use the Jakarta REST standard `jakarta.ws.rs.BeanParam` annotation which is supported on both the server and the client.
ja_jp: 前の表には `org.jboss.resteasy.annotations.Form` アノテーションは含まれていません。これは、Quarkus REST 固有の代替が存在しないためです。 代わりに、サーバーとクライアントの両方でサポートされている Jakarta REST 標準の `jakarta.ws.rs.BeanParam` アノテーションを使用することを推奨します。

source: The previous table does not include the `org.jboss.resteasy.annotations.Form` annotation because there is no RESTEasy Reactive specific replacement for it. Users are instead encouraged to use the JAX-RS standard `javax.ws.rs.BeanParam` annotation which is supported on both the server and the client.
ja_jp: 前の表には `org.jboss.resteasy.annotations.Form` アノテーションは含まれていません。RESTEasy Reactive に特化した代替品がないためです。代わりに、サーバーとクライアントの両方でサポートされている JAX-RS 標準の `javax.ws.rs.BeanParam` アノテーションを使用することが推奨されます。

source: The previous table does not include the `org.jboss.resteasy.annotations.Form` annotation because there is no RESTEasy Reactive specific replacement for it. Users are instead encouraged to use the Jakarta REST standard `jakarta.ws.rs.BeanParam` annotation which is supported on both the server and the client.
ja_jp: `org.jboss.resteasy.annotations.Form` アノテーションは、RESTEasy Reactive固有の代替品がないため、前の表には含まれていません。その代わりに、サーバーとクライアントの両方でサポートされているJakarta REST標準の `jakarta.ws.rs.BeanParam` アノテーションを使用することが推奨されます。

source: The price consumer
ja_jp: 価格のコンシューマー

source: The price consumer reads the prices from JMS, and stores the last one. Create the `src/main/java/org/acme/jms/PriceConsumer.java` file with the following content:
ja_jp: 価格のコンシューマーはJMSから価格を読み取り、最後の1つを保存します。以下の内容で `src/main/java/org/acme/jms/PriceConsumer.java` ファイルを作成します。

source: The price producer
ja_jp: 価格のプロデューサー

source: The price resource
ja_jp: 価格のリソース

source: The primary HTTP interface serves the challenge and is accessible from your DNS domain name.
ja_jp: プライマリー HTTP インターフェイスがチャレンジを提供し、DNS ドメイン名からアクセス可能です。

source: The problem fact and planning entity properties
ja_jp: 問題の事実とプランニングエンティティーのプロパティー

source: The problem is obviously that the heroku-cli can’t find docker. This is quite easy to resolve, because the podman cli is docker-compatible. We just need to create a symlink from podman to docker:
ja_jp: 問題は、明らかに heroku-cli が docker を見つけられないことです。podman cli は docker と互換性があるため、これは簡単に解決できます。podman から docker へのシンボリックリンクを作成するだけです。

source: The process begins with a User Query, which is first processed by a Query Transformer to refine or enhance it for more effective retrieval. The transformed query is then passed to a Query Router that decides which knowledge sources to target. For unstructured data, the ingestion pipeline remains the same as in the foundational RAG architecture (documents split, embedded, and stored in a vector store), but contextual RAG extends retrieval to multiple sources such as structured databases, APIs, and search indexes.
ja_jp: このプロセスはユーザーのクエリから始まり、まずクエリ変換器によって、より効果的な検索のために洗練または強化されます。変換されたクエリは、次にクエリルーティングに渡され、どの知識ソースをターゲットにするかを決定します。非構造化データの場合、取り込みパイプラインは基本的なRAGアーキテクチャ (ドキュメントは分割され、埋め込み化され、ベクトルストアに保存されます) と同じですが、コンテキストRAGは、構造化データベース、API、検索インデックスなどの複数ソースに情報検索を拡張します。

source: The process for Gradle is analogous.
ja_jp: Gradle のプロセスも同様です。

source: The process is pretty much the same. We opt in to compiling a native image inside a local container, so that we don't have to deal with installing GraalVM locally:
ja_jp: プロセスはほとんど同じです。 ここでは、ローカルコンテナー内でネイティブイメージをコンパイルすることを選択し、ローカルに GraalVM をインストールする必要がないようにしています。

source: The produced and consumed mime types using `produces`, and `consumes`
ja_jp: `produces` と `consumes` を使用して生成および消費された mime タイプ。

source: The produced executable will be a 64 bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a Docker container. Note that in this case the build itself runs in a Docker container too, so you don't need to have GraalVM installed locally.
ja_jp: 生成される実行ファイルは64bitのLinux実行ファイルになるので、OSによっては実行できなくなる可能性があります。しかし、Dockerコンテナーにコピーするので問題ありません。この場合、ビルド自体もDockerコンテナー内で動作するので、ローカルにGraalVMをインストールする必要はないことに注意してください。

source: The produced executable will be a 64 bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a container. The project generation has provided a `Dockerfile.native-micro` in the `src/main/docker` directory with the following content:
ja_jp: 作成される実行ファイルは64ビットのLinux実行ファイルなので、OSによっては実行できなくなる可能性があります。 しかし、コンテナにコピーするのですから問題ありません。 プロジェクト生成では、 `src/main/docker` ディレクトリに以下の内容の `Dockerfile.native-micro` を用意しています：

source: The produced executable will be a 64-bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a Docker container. Note that in this case the build itself runs in a Docker container too, so you don't need to have GraalVM installed locally.
ja_jp: 生成される実行ファイルは64bitのLinux実行ファイルになるので、OSによっては実行できなくなる可能性があります。しかし、Dockerコンテナーにコピーするので問題ありません。この場合、ビルド自体もDockerコンテナー内で動作するので、ローカルにGraalVMをインストールする必要はないことに注目してください。

source: The produced executable will be a 64-bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a container. The project generation has provided a `Dockerfile.native-micro` in the `src/main/docker` directory with the following content:
ja_jp: 生成される実行ファイルは 64 ビットの Linux 実行ファイルになるので、お使いの OS によっては実行できなくなる可能性があります。しかし、コンテナにコピーするので問題ありません。プロジェクト生成では、 `src/main/docker` ディレクトリに `Dockerfile.native-micro` を用意し、以下のような内容にしています:

source: The produced executable will be a 64-bit Linux executable, so depending on your operating system, it may no longer be runnable. However, it's not an issue as we are going to copy it to a Docker container. Note that in this case the build itself runs in a Docker container too, so you don't need to have GraalVM installed locally.
ja_jp: 作成された実行ファイルは64bitのLinux実行ファイルとなりますので、OSによっては実行可能でなくなる可能性があります。しかし、今回はDockerコンテナにコピーするため問題ありません。なお、この場合、ビルド自体もDockerコンテナで実行されるため、ローカルにGraalVMがインストールされている必要はありません。

source: The produced executable will be a 64-bit Linux executable, so depending on your operating system, it may no longer be runnable. However, it's not an issue as we are going to copy it to a container. The project generation has provided a `Dockerfile.native-micro` in the `src/main/docker` directory with the following content:
ja_jp: 生成された実行ファイルは 64 ビット Linux 実行ファイルになるため、OS によっては実行できなくなる可能性があります。しかし、コンテナーにコピーするため問題ありません。プロジェクト生成時に、以下の内容の `Dockerfile.native-micro` が `src/main/docker` ディレクトリーに提供されています。

source: The profile aware file must be present in the exact same location as the main `application.properties` file.
ja_jp: プロファイル対応ファイルは、メインの `application.properties` ファイルとまったく同じ場所に存在する必要があります。

source: The profile can be provided directly in the Maven build's command thanks to the system property `quarkus.profile` with a command of type:
ja_jp: 以下のタイプのコマンドを持つシステムプロパティー `quarkus.profile` により、プロファイルは Maven ビルドのコマンドで直接提供できます。

source: The project also imports the Quarkus REST (formerly RESTEasy Reactive) and scheduler extensions.
ja_jp: このプロジェクトでは、Quarkus REST（旧RESTEasy Reactive）とスケジューラーのエクステンションもインポートしています。

source: The project also imports the RESTEasy Reactive and scheduler extensions.
ja_jp: Maven プロジェクトは、RESTEasy Reactive と scheduler エクステンションもインポートします。

source: The project also imports the RESTEasy and scheduler extensions.
ja_jp: また、RESTEasyとスケジューラーのエクステンションをインポートしています。

source: The project generation has also provided a `Dockerfile.native` in the `src/main/docker` directory with the following content:
ja_jp: プロジェクト生成では、以下の内容の `src/main/docker docker` ディレクトリも提供されます:

source: The project has landed in the Quarkus master branch, so if you’re eager to try it out, you'll have to build Quarkus from source by following https://github.com/quarkusio/quarkus/blob/master/CONTRIBUTING.md#building-master[this] and use the proper BOM and version following https://github.com/quarkusio/quarkus/blob/master/CONTRIBUTING.md#updating-the-version[this].
ja_jp: このプロジェクトはQuarkus masterブランチにありますので、試してみたい方は、 https://github.com/quarkusio/quarkus/blob/master/CONTRIBUTING.md#building-master[this]のようにソースからQuarkusをビルドし、 https://github.com/quarkusio/quarkus/blob/master/CONTRIBUTING.md#updating-the-version[this]のように適切なBOMとバージョンを使用してください。

source: The project has moved under the SmallRye umbrella and the `groupId` has been changed to `io.smallrye`. The package name was kept identical.
ja_jp: プロジェクトはSmallRyeの傘下に入り、 `groupId` は `io.smallrye` に変更されました。 パッケージ名は同一に保たれています。

source: The project is generated in a directory named after the passed artifactId.
ja_jp: プロジェクトは、渡されたartifactIdにちなんだ名前のディレクトリに生成されます。

source: The project is generated in a directory named after the passed artifactId. If the directory already exists, the generation fails.
ja_jp: プロジェクトは、渡された artifactId にちなんだ名前のディレクトリーに生成されます。ディレクトリーが既に存在する場合は、生成に失敗します。

source: The project is located in the `rest-client-quickstart` link:{quickstarts-tree-url}/rest-client-quickstart[directory].
ja_jp: プロジェクトは `rest-client-quickstart` link:{quickstarts-tree-url}/rest-client-quickstart[ディレクトリ] にあります。

source: The project is located in the `rest-client-quickstart` {quickstarts-tree-url}/rest-client-quickstart[directory].
ja_jp: プロジェクトは `rest-client-quickstart` {quickstarts-tree-url}/rest-client-quickstart[directory] にあります。

source: The project is located in the `resteasy-client-quickstart` link:{quickstarts-tree-url}/resteasy-client-quickstart[directory].
ja_jp: プロジェクトは `resteasy-client-quickstart` link:{quickstarts-tree-url}/resteasy-client-quickstart[ディレクトリ] にあります。

source: The project must be hosted at a GitHub repository before we continue. This task can be completed by logging into your GitHub account, creating a new repository, and adding the newly created sources to said repository. Choose the `main` branch as default to take advantage of conventions and thus configure less in your `pom.xml`.
ja_jp: この作業を続ける前に、プロジェクトをGitHubリポジトリでホストする必要があります。この作業は、GitHub アカウントにログインし、新しいリポジトリを作成して、新しく作成したソースをそのリポジトリに追加することで完了します。 `main` ブランチをデフォルトとして選択すると、規約を利用して `pom.xml` で設定を少なくすることが可能です。

source: The project should also contain a simple test:
ja_jp: プロジェクトには簡単なテストも含まれているはずです:

source: The project will also need a test:
ja_jp: また、プロジェクトにはテストも必要です:
